pag2/app/controllers/conformidades_controller.rb

SELECT "conformidades".* FROM "conformidades"
---
  def index
#    @conformidades = Conformidade.all
#    @conformidades = Conformidade.order(:id).reverse_order.page(params[:page]).per(3)
    @conformidades = Conformidade.accessible_by(current_ability).inverso_id.page(params[:page]).per(10)

SELECT "conformidades".* FROM "conformidades" WHERE "conformidades"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @conformidade = Conformidade.find(params[:id])

SELECT "conformidades".* FROM "conformidades" WHERE "conformidades"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @conformidade = Conformidade.find(params[:id])

SELECT "conformidades".* FROM "conformidades" WHERE "conformidades"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "conformidades" SET "processo" = '123/2011', "fornecedor_id" = 1, "valor" = 12.0, "observacao" = 'doze', "data" = '2011-10-21', "updated_at" = '2011-10-21 12:11:37.024126' WHERE "conformidades"."id" = 1
---
  def update
    @conformidade = Conformidade.find(params[:id])

    respond_to do |format|
      if @conformidade.update_attributes(params[:conformidade])